cool/tutorials/surfaceTracking/interTrackFoam/hydrofoil/0/motionU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       tetPointVectorField;
    location    "0";
    object      motionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [ 0 1 0 0 0 0 0 ];

internalField       uniform (0 0 0);

referenceLevel      (0 0 0);

boundaryField
{
    bottom
    {
        type fixedValue;
        value uniform (0 0 0);
    }

    hydrofoil
    {
        type fixedValue;
        value uniform (0 0 0);
    }

    freeSurface
    {
        type fixedValue;
        value uniform (0 0 0);
    }

    outlet
    {
        type slip;
    }

    inlet
    {
        type slip;
    }

    frontAndBackPlanes
    {
        type empty;
    }
}

// ************************************************************************* //
