cool/tutorials/surfaceTracking/interTrackFoam/hydrofoil/Allrun
#!/bin/sh

. $WM_PROJECT_DIR/bin/tools/RunFunctions


application="interTrackFoam"

runApplication makeFaMesh
runApplication $application
